app/controllers/backoffice/admins_controller.rb

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO "admins" ("name", "email", "role", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @admin.update(params_admin)
---
UPDATE "admins" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "gribeiro@bionexo.com"], ["encrypted_password", "$2a$11$e3MtsnWiAUkmzbfjl5PWSOJt9NKM9RcV7zB7KgqVabxYPPK0m3SQG"], ["updated_at", "2019-09-16 22:57:33.679034"], ["id", 2]]

  def destroy
    authorize @admin
    admin_email = @admin.email

    if @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["id", 1]]