app/controllers/backoffice/categories_controller.rb

  def index
  	@categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = CategoryService.create(params_category)
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "João do Vibão"], ["created_at", "2019-09-09 21:38:19.105286"], ["updated_at", "2019-09-09 21:38:19.105286"]]

  def update
    @category.update(params_category)
---
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "João do Vibão e Combão"], ["updated_at", "2019-09-09 22:54:25.119922"], ["id", 12]]

    def set_category
      @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 12]]